; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v3 - type_3 ?v8 - type_2)
 	      (pred_4 ?v4 - object ?v8 - type_2)
	      (pred_3 ?v3 - type_3 ?v5 - type_1)
	      (pred_1 ?v3 - type_3 ?v4 - object ?v5 - type_1))

   (:action op_2
       :parameters  (?v3 - type_3 ?v2 ?v1 - type_2)
       :precondition (and  (pred_2 ?v3 ?v2))
       :effect (and  (pred_2 ?v3 ?v1)
		     (not (pred_2 ?v3 ?v2))))

   (:action op_1
       :parameters (?v3 - type_3 ?v7 - object ?v6 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v6) (pred_2 ?v3 ?v6) (pred_3 ?v3 ?v5))
       :effect (and (pred_1 ?v3 ?v7 ?v5)
		    (not (pred_4 ?v7 ?v6)) 
		    (not (pred_3 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_3 ?v7 - object ?v6 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v7 ?v5) (pred_2 ?v3 ?v6))
       :effect (and (pred_4 ?v7 ?v6)
		    (pred_3 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v7 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_03 - type_3
obj_04 obj_01 obj_02 obj_05 - type_1
obj_06 obj_12 obj_09 obj_08 - type_2
obj_10 obj_07 obj_13 - object)
(:init
(pred_2 obj_11 obj_12)
(pred_3 obj_11 obj_04)
(pred_3 obj_11 obj_01)
(pred_2 obj_03 obj_08)
(pred_3 obj_03 obj_02)
(pred_3 obj_03 obj_05)
(pred_4 obj_10 obj_09)
(pred_4 obj_07 obj_09)
(pred_4 obj_13 obj_12)
)
(:goal
(and
(pred_4 obj_10 obj_06)
(pred_4 obj_07 obj_08)
(pred_4 obj_13 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_11 obj_08) (pred_2 obj_03 obj_08))))
  )
)
)

; plan
1. (op_1 obj_11 obj_13 obj_12 obj_01)
   deleted: (pred_4 obj_13 obj_12) (pred_3 obj_11 obj_01)
   added: (pred_1 obj_11 obj_13 obj_01)
   goals met: 0 of 3
2. (op_2 obj_03 obj_08 obj_06)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_06)
   goals met: 0 of 3
3. (op_2 obj_11 obj_12 obj_09)
   deleted: (pred_2 obj_11 obj_12)
   added: (pred_2 obj_11 obj_09)
   goals met: 0 of 3
4. (op_2 obj_03 obj_06 obj_09)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_09)
   goals met: 0 of 3
5. (op_1 obj_11 obj_07 obj_09 obj_04)
   deleted: (pred_4 obj_07 obj_09) (pred_3 obj_11 obj_04)
   added: (pred_1 obj_11 obj_07 obj_04)
   goals met: 0 of 3
6. (op_1 obj_03 obj_10 obj_09 obj_05)
   deleted: (pred_4 obj_10 obj_09) (pred_3 obj_03 obj_05)
   added: (pred_1 obj_03 obj_10 obj_05)
   goals met: 0 of 3
7. (op_2 obj_11 obj_09 obj_08)
   deleted: (pred_2 obj_11 obj_09)
   added: (pred_2 obj_11 obj_08)
   goals met: 0 of 3
8. (op_2 obj_03 obj_09 obj_06)
   deleted: (pred_2 obj_03 obj_09)
   added: (pred_2 obj_03 obj_06)
   goals met: 0 of 3
9. (op_3 obj_11 obj_13 obj_08 obj_01)
   deleted: (pred_1 obj_11 obj_13 obj_01)
   added: (pred_4 obj_13 obj_08) (pred_3 obj_11 obj_01)
   goals met: 1 of 3
10. (op_3 obj_11 obj_07 obj_08 obj_04)
   deleted: (pred_1 obj_11 obj_07 obj_04)
   added: (pred_4 obj_07 obj_08) (pred_3 obj_11 obj_04)
   goals met: 2 of 3
11. (op_3 obj_03 obj_10 obj_06 obj_05)
   deleted: (pred_1 obj_03 obj_10 obj_05)
   added: (pred_4 obj_10 obj_06) (pred_3 obj_03 obj_05)
   goals met: 3 of 3
